In [ ]:
import pandas as pd
pd.__version__

'1.1.5'

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/sana/house.csv")
print(df)

   year build   2nd floor  kitchten   bath  area  saleprice
0         2001      854.0          2     1  1710     200500
1         2001        NaN          3     1  1262     181500
2         2003      866.0          1     2  1786     223500
3         2003        NaN          1     3  1717     140000
4         2004      756.0          2     2  2198     250000
5         2005     1053.0          2     2  2300     200000

In [ ]:
df.describe()

,year build,2nd floor,kitchten,bath,area,saleprice
count,6.000000,4.000000,6.000000,6.000000,6.000000,6.000000
mean,2002.833333,882.250000,1.833333,1.833333,1828.833333,199250.000000
std,1.602082,124.038636,0.752773,0.752773,376.309669,37393.515481
min,2001.000000,756.000000,1.000000,1.000000,1262.000000,140000.000000
25%,2001.500000,829.500000,1.250000,1.250000,1711.750000,186125.000000
50%,2003.000000,860.000000,2.000000,2.000000,1751.500000,200250.000000
75%,2003.750000,912.750000,2.000000,2.000000,2095.000000,217750.000000
max,2005.000000,1053.000000,3.000000,3.000000,2300.000000,250000.000000

In [ ]:
df.min()

year build       2001.0
2nd floor         756.0
kitchten            1.0
bath                1.0
area             1262.0
saleprice      140000.0
dtype: float64

In [ ]:
df.max()

year build       2005.0
2nd floor        1053.0
kitchten            3.0
bath                3.0
area             2300.0
saleprice      250000.0
dtype: float64

In [ ]:
df.std()

year build         1.602082
2nd floor        124.038636
kitchten           0.752773
bath               0.752773
area             376.309669
saleprice      37393.515481
dtype: float64

In [ ]:
df.sort_values(by='bath')

   year build   2nd floor  kitchten   bath  area  saleprice
0         2001      854.0          2     1  1710     200500
1         2001        NaN          3     1  1262     181500
2         2003      866.0          1     2  1786     223500
4         2004      756.0          2     2  2198     250000
5         2005     1053.0          2     2  2300     200000
3         2003        NaN          1     3  1717     140000

In [ ]:
df.sort_values(by=['bath','area'])

   year build   2nd floor  kitchten   bath  area  saleprice
1         2001        NaN          3     1  1262     181500
0         2001      854.0          2     1  1710     200500
2         2003      866.0          1     2  1786     223500
4         2004      756.0          2     2  2198     250000
5         2005     1053.0          2     2  2300     200000
3         2003        NaN          1     3  1717     140000

In [ ]:
df1=df.sort_values(by=['bath','area'], inplace=True, ascending=[True, False])
print(df1)

None

In [ ]:
df.head()

   year build   2nd floor  kitchten   bath  area  saleprice
0         2001      854.0          2     1  1710     200500
1         2001        NaN          3     1  1262     181500
2         2003      866.0          1     2  1786     223500
3         2003        NaN          1     3  1717     140000
4         2004      756.0          2     2  2198     250000

In [ ]:
#slicing

In [ ]:
print (df[0:2])

   year build   2nd floor  kitchten   bath  area  saleprice
0         2001      854.0          2     1  1710     200500
1         2001        NaN          3     1  1262     181500

In [ ]:
print (df[['area','bath']])

   area  bath
0  1710     1
1  1262     1
2  1786     2
3  1717     3
4  2198     2
5  2300     2

In [ ]:
print (df['area'][0:2])

0    1710
1    1262
Name: area, dtype: int64

In [ ]:
#filtring

In [ ]:
print (df [df['bath'] == 2])

   year build   2nd floor  kitchten   bath  area  saleprice
2         2003      866.0          1     2  1786     223500
4         2004      756.0          2     2  2198     250000
5         2005     1053.0          2     2  2300     200000

In [ ]:
print (df [df['area'] != 2000])

   year build   2nd floor  kitchten   bath  area  saleprice
0         2001      854.0          2     1  1710     200500
1         2001        NaN          3     1  1262     181500
2         2003      866.0          1     2  1786     223500
3         2003        NaN          1     3  1717     140000
4         2004      756.0          2     2  2198     250000
5         2005     1053.0          2     2  2300     200000

In [ ]:
#sorting

In [ ]:
print (df.sort_values( by ='area'))

   year build   2nd floor  kitchten   bath  area  saleprice
1         2001        NaN          3     1  1262     181500
0         2001      854.0          2     1  1710     200500
3         2003        NaN          1     3  1717     140000
2         2003      866.0          1     2  1786     223500
4         2004      756.0          2     2  2198     250000
5         2005     1053.0          2     2  2300     200000

In [ ]:
df_sorted = df.sort_values( by =['area','bath'])
print(df_sorted)

   year build   2nd floor  kitchten   bath  area  saleprice
1         2001        NaN          3     1  1262     181500
0         2001      854.0          2     1  1710     200500
3         2003        NaN          1     3  1717     140000
2         2003      866.0          1     2  1786     223500
4         2004      756.0          2     2  2198     250000
5         2005     1053.0          2     2  2300     200000

In [ ]:
#filling

In [ ]:
print(df.fillna(99))

   year build   2nd floor  kitchten   bath  area  saleprice
1         2001       99.0          3     1  1262     181500
0         2001      854.0          2     1  1710     200500
3         2003       99.0          1     3  1717     140000
2         2003      866.0          1     2  1786     223500
4         2004      756.0          2     2  2198     250000
5         2005     1053.0          2     2  2300     200000

In [ ]:
print(df.fillna(df.mean()))

   year build   2nd floor  kitchten   bath  area  saleprice
1         2001     882.25          3     1  1262     181500
0         2001     854.00          2     1  1710     200500
3         2003     882.25          1     3  1717     140000
2         2003     866.00          1     2  1786     223500
4         2004     756.00          2     2  2198     250000
5         2005    1053.00          2     2  2300     200000

In [ ]:
df1=df[['bath','area']]
print(df1)

   bath  area
1     1  1262
0     1  1710
3     3  1717
2     2  1786
4     2  2198
5     2  2300

In [ ]:
df2=df[['2nd floor','area']].fillna(df.min())
print(df2)

   2nd floor  area
1      756.0  1262
0      854.0  1710
3      756.0  1717
2      866.0  1786
4      756.0  2198
5     1053.0  2300
   2nd floor  area
1     1053.0  1262
0      854.0  1710
3     1053.0  1717
2      866.0  1786
4      756.0  2198
5     1053.0  2300

In [ ]:
df8=df[['2nd floor','area']].fillna(df.max())
print(df8)

   2nd floor  area
1     1053.0  1262
0      854.0  1710
3     1053.0  1717
2      866.0  1786
4      756.0  2198
5     1053.0  2300

In [ ]:
df.head()

   year build   2nd floor  kitchten   bath  area  saleprice
1         2001        NaN          3     1  1262     181500
0         2001      854.0          2     1  1710     200500
3         2003        NaN          1     3  1717     140000
2         2003      866.0          1     2  1786     223500
4         2004      756.0          2     2  2198     250000

In [ ]:
df.head(2)

   year build   2nd floor  kitchten   bath  area  saleprice
1         2001        NaN          3     1  1262     181500
0         2001      854.0          2     1  1710     200500

In [ ]:
df4=df[['saleprice','area']].head(2)
df5=df[['bath','area']].tail(2)
print(df4)
print(df5)

   saleprice  area
1     181500  1262
0     200500  1710
   bath  area
4     2  2198
5     2  2300

In [ ]:
df6=pd.merge(df4,df5)
print(df6)

Empty DataFrame
Columns: [saleprice, area, bath]
Index: []